CoreMaker-lab/RA4L1_LSM6DSV16X_LIS2MDL/RA4L1_LSM6DSV16X_LIS2MDL_Project2/src/hal_entry.c
#include "hal_data.h"
#include <stdio.h>
#include "lsm6dsv16x_reg.h"
#include "lis2mdl_reg.h"
FSP_CPP_HEADER
void R_BSP_WarmStart(bsp_warm_start_event_t event);
FSP_CPP_FOOTER



fsp_err_t err = FSP_SUCCESS;
volatile bool uart_send_complete_flag = false;
void user_uart_callback (uart_callback_args_t * p_args)
{
    if(p_args->event == UART_EVENT_TX_COMPLETE)
    {
        uart_send_complete_flag = true;
    }
}


#ifdef __GNUC__                                 //串口重定向
    #define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
    #define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif

PUTCHAR_PROTOTYPE
{
        err = R_SCI_UART_Write(&g_uart9_ctrl, (uint8_t *)&ch, 1);
        if(FSP_SUCCESS != err) __BKPT();
        while(uart_send_complete_flag == false){}
        uart_send_complete_flag = false;
        return ch;
}

int _write(int fd,char *pBuffer,int size)
{
    for(int i=0;i<size;i++)
    {
        __io_putchar(*pBuffer++);
    }
    return size;
}

/* Callback function */
i2c_master_event_t i2c_event = I2C_MASTER_EVENT_ABORTED;
uint32_t  timeout_ms = 1000000;
void i2c_master_callback(i2c_master_callback_args_t *p_args)
{
    i2c_event = I2C_MASTER_EVENT_ABORTED;
    if (NULL != p_args)
    {
        /* capture callback event for validating the i2c transfer event*/
        i2c_event = p_args->event;
    }
}

#define SENSOR_BUS g_i2c_master0_ctrl

/* Private macro -------------------------------------------------------------*/
#define    BOOT_TIME            10 //ms

/* Private variables ---------------------------------------------------------*/
static int16_t data_raw_acceleration[3];
static int16_t data_raw_angular_rate[3];
static int16_t data_raw_temperature;
static double_t acceleration_mg[3];
static double_t angular_rate_mdps[3];
static double_t temperature_degC;
static uint8_t whoamI;
static uint8_t tx_buffer[1000];

static lsm6dsv16x_filt_settling_mask_t filt_settling_mask;

/* Extern variables ----------------------------------------------------------*/

/* Private functions ---------------------------------------------------------*/

/*
 *   WARNING:
 *   Functions declare in this section are defined at the end of this file
 *   and are strictly related to the hardware platform used.
 *
 */
static int32_t platform_write(void *handle, uint8_t reg, const uint8_t *bufp,
                              uint16_t len);
static int32_t platform_read(void *handle, uint8_t reg, uint8_t *bufp,
                             uint16_t len);
static void tx_com( uint8_t *tx_buffer, uint16_t len );
static void platform_delay(uint32_t ms);
static void platform_init(void *handle);

/* Private variables ---------------------------------------------------------*/
static int16_t data_raw_magnetic[3];
static int16_t data_raw_temperature;
static float_t magnetic_mG[3];
//static float_t temperature_degC;
static uint8_t whoamI, rst;
static uint8_t tx_buffer[1000];

/* Extern variables ----------------------------------------------------------*/

/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    /* TODO: add your own code here */

    /* Open the transfer instance with initial configuration. */
    err = R_SCI_UART_Open(&g_uart9_ctrl, &g_uart9_cfg);
    assert(FSP_SUCCESS == err);
    printf("hello!\n");

    /* Initialize the I2C module */
    err = R_IIC_MASTER_Open(&g_i2c_master0_ctrl, &g_i2c_master0_cfg);
    /* Handle any errors. This function should be defined by the user. */
    assert(FSP_SUCCESS == err);

    //LSM6DSV16X SA0->0
    R_IOPORT_PinWrite(&g_ioport_ctrl, BSP_IO_PORT_04_PIN_03, BSP_IO_LEVEL_LOW);
    //LSM6DSV16X CS1->1
    R_IOPORT_PinWrite(&g_ioport_ctrl, BSP_IO_PORT_05_PIN_05, BSP_IO_LEVEL_HIGH);
    //LIS2MDL CS2->1
    R_IOPORT_PinWrite(&g_ioport_ctrl, BSP_IO_PORT_03_PIN_01, BSP_IO_LEVEL_HIGH);


//    lsm6dsv16x_reset_t rst;
//    stmdev_ctx_t dev_ctx;
//    /* Initialize mems driver interface */
//    dev_ctx.write_reg = platform_write;
//    dev_ctx.read_reg = platform_read;
//    dev_ctx.mdelay = platform_delay;
//    dev_ctx.handle = &SENSOR_BUS;
//
//    /* Init test platform */
////    platform_init(dev_ctx.handle);
//    /* Wait sensor boot time */
//    platform_delay(BOOT_TIME);
//
//    /* Check device ID */
//    lsm6dsv16x_device_id_get(&dev_ctx, &whoamI);
//    printf("LSM6DSV16X_ID=0x%x,whoamI=0x%x\n",LSM6DSV16X_ID,whoamI);
//    if (whoamI != LSM6DSV16X_ID)
//      while (1);
//
//    /* Restore default configuration */
//    lsm6dsv16x_reset_set(&dev_ctx, LSM6DSV16X_RESTORE_CTRL_REGS);
//    do {
//      lsm6dsv16x_reset_get(&dev_ctx, &rst);
//    } while (rst != LSM6DSV16X_READY);
//
//    /* Enable Block Data Update */
//    lsm6dsv16x_block_data_update_set(&dev_ctx, PROPERTY_ENABLE);
//    /* Set Output Data Rate.
//     * Selected data rate have to be equal or greater with respect
//     * with MLC data rate.
//     */
//    lsm6dsv16x_xl_data_rate_set(&dev_ctx, LSM6DSV16X_ODR_AT_7Hz5);
//    lsm6dsv16x_gy_data_rate_set(&dev_ctx, LSM6DSV16X_ODR_AT_15Hz);
//    /* Set full scale */
//    lsm6dsv16x_xl_full_scale_set(&dev_ctx, LSM6DSV16X_2g);
//    lsm6dsv16x_gy_full_scale_set(&dev_ctx, LSM6DSV16X_2000dps);
//    /* Configure filtering chain */
//    filt_settling_mask.drdy = PROPERTY_ENABLE;
//    filt_settling_mask.irq_xl = PROPERTY_ENABLE;
//    filt_settling_mask.irq_g = PROPERTY_ENABLE;
//    lsm6dsv16x_filt_settling_mask_set(&dev_ctx, filt_settling_mask);
//    lsm6dsv16x_filt_gy_lp1_set(&dev_ctx, PROPERTY_ENABLE);
//    lsm6dsv16x_filt_gy_lp1_bandwidth_set(&dev_ctx, LSM6DSV16X_GY_ULTRA_LIGHT);
//    lsm6dsv16x_filt_xl_lp2_set(&dev_ctx, PROPERTY_ENABLE);
//    lsm6dsv16x_filt_xl_lp2_bandwidth_set(&dev_ctx, LSM6DSV16X_XL_STRONG);


    R_IIC_MASTER_SlaveAddressSet(&g_i2c_master0_ctrl, 0x1E, I2C_MASTER_ADDR_MODE_7BIT);
    assert(FSP_SUCCESS == err);



    /* Initialize mems driver interface */
    stmdev_ctx_t dev_ctx;
    dev_ctx.write_reg = platform_write;
    dev_ctx.read_reg = platform_read;
    dev_ctx.mdelay = platform_delay;
    dev_ctx.handle = &SENSOR_BUS;
    /* Initialize platform specific hardware */
//    platform_init();
    /* Wait sensor boot time */
    platform_delay(BOOT_TIME);

    /* Check device ID */
    lis2mdl_device_id_get(&dev_ctx, &whoamI);
    printf("LIS2MDL_ID=0x%x,whoamI=0x%x\n",LIS2MDL_ID,whoamI);
    if (whoamI != LIS2MDL_ID)
      while (1) {
        /* manage here device not found */
      }

    /* Restore default configuration */
    lis2mdl_reset_set(&dev_ctx, PROPERTY_ENABLE);

    do {
      lis2mdl_reset_get(&dev_ctx, &rst);
    } while (rst);

    /* Enable Block Data Update */
    lis2mdl_block_data_update_set(&dev_ctx, PROPERTY_ENABLE);
    /* Set Output Data Rate */
    lis2mdl_data_rate_set(&dev_ctx, LIS2MDL_ODR_10Hz);
    /* Set / Reset sensor mode */
    lis2mdl_set_rst_mode_set(&dev_ctx, LIS2MDL_SENS_OFF_CANC_EVERY_ODR);
    /* Enable temperature compensation */
    lis2mdl_offset_temp_comp_set(&dev_ctx, PROPERTY_ENABLE);
    /* Set device in continuous mode */
    lis2mdl_operating_mode_set(&dev_ctx, LIS2MDL_CONTINUOUS_MODE);




//    /* Read samples in polling mode (no int) */
//    while (1) {
//      lsm6dsv16x_data_ready_t drdy;
//
//      /* Read output only if new xl value is available */
//      lsm6dsv16x_flag_data_ready_get(&dev_ctx, &drdy);
//
//      if (drdy.drdy_xl) {
//        /* Read acceleration field data */
//        memset(data_raw_acceleration, 0x00, 3 * sizeof(int16_t));
//        lsm6dsv16x_acceleration_raw_get(&dev_ctx, data_raw_acceleration);
//        acceleration_mg[0] =
//          lsm6dsv16x_from_fs2_to_mg(data_raw_acceleration[0]);
//        acceleration_mg[1] =
//          lsm6dsv16x_from_fs2_to_mg(data_raw_acceleration[1]);
//        acceleration_mg[2] =
//          lsm6dsv16x_from_fs2_to_mg(data_raw_acceleration[2]);
//        printf("Acceleration [mg]:%4.2f\t%4.2f\t%4.2f\r\n",
//                acceleration_mg[0], acceleration_mg[1], acceleration_mg[2]);
//      }
//
//      /* Read output only if new xl value is available */
//      if (drdy.drdy_gy) {
//        /* Read angular rate field data */
//        memset(data_raw_angular_rate, 0x00, 3 * sizeof(int16_t));
//        lsm6dsv16x_angular_rate_raw_get(&dev_ctx, data_raw_angular_rate);
//        angular_rate_mdps[0] =
//          lsm6dsv16x_from_fs2000_to_mdps(data_raw_angular_rate[0]);
//        angular_rate_mdps[1] =
//          lsm6dsv16x_from_fs2000_to_mdps(data_raw_angular_rate[1]);
//        angular_rate_mdps[2] =
//          lsm6dsv16x_from_fs2000_to_mdps(data_raw_angular_rate[2]);
//        printf("Angular rate [mdps]:%4.2f\t%4.2f\t%4.2f\r\n",
//                angular_rate_mdps[0], angular_rate_mdps[1], angular_rate_mdps[2]);
//
//      }
//
////      if (drdy.drdy_temp) {
////        /* Read temperature data */
////        memset(&data_raw_temperature, 0x00, sizeof(int16_t));
////        lsm6dsv16x_temperature_raw_get(&dev_ctx, &data_raw_temperature);
////        temperature_degC = lsm6dsv16x_from_lsb_to_celsius(
////                             data_raw_temperature);
////        printf("Temperature [degC]:%6.2f\r\n", temperature_degC);
////      }
//    }

    /* Read samples in polling mode (no int) */
     while (1) {
       uint8_t reg;
       /* Read output only if new value is available */
       lis2mdl_mag_data_ready_get(&dev_ctx, &reg);

       if (reg) {
         /* Read magnetic field data */
         memset(data_raw_magnetic, 0x00, 3 * sizeof(int16_t));
         lis2mdl_magnetic_raw_get(&dev_ctx, data_raw_magnetic);
         magnetic_mG[0] = lis2mdl_from_lsb_to_mgauss(data_raw_magnetic[0]);
         magnetic_mG[1] = lis2mdl_from_lsb_to_mgauss(data_raw_magnetic[1]);
         magnetic_mG[2] = lis2mdl_from_lsb_to_mgauss(data_raw_magnetic[2]);
         printf("Magnetic field [mG]:%4.2f\t%4.2f\t%4.2f\r\n",
                 magnetic_mG[0], magnetic_mG[1], magnetic_mG[2]);

         /* Read temperature data */
         memset(&data_raw_temperature, 0x00, sizeof(int16_t));
         lis2mdl_temperature_raw_get(&dev_ctx, &data_raw_temperature);
         temperature_degC = lis2mdl_from_lsb_to_celsius(data_raw_temperature);
         printf("Temperature [degC]:%6.2f\r\n",
                 temperature_degC);

       }
     }



#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

/*
 * @brief  Write generic device register (platform dependent)
 *
 * @param  handle    customizable argument. In this examples is used in
 *                   order to select the correct sensor bus handler.
 * @param  reg       register to write
 * @param  bufp      pointer to data to write in register reg
 * @param  len       number of consecutive register to write
 *
 */
static int32_t platform_write(void *handle, uint8_t reg, const uint8_t *bufp,uint16_t len)
{
    // 创建一个足够大的缓冲区来包含寄存器地址和数据
    uint8_t data[len + 1];
    data[0] = reg; // 将寄存器地址放在数据的开始
    memcpy(&data[1], bufp, len); // 复制数据到缓冲区

    err = R_IIC_MASTER_Write(&g_i2c_master0_ctrl, data, len+1, true);
    assert(FSP_SUCCESS == err);
    /* Since there is nothing else to do, block until Callback triggers*/
    //while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms)
    while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms>0)
    {
        R_BSP_SoftwareDelay(1U, BSP_DELAY_UNITS_MICROSECONDS);
        timeout_ms--;
        }
    if (I2C_MASTER_EVENT_ABORTED == i2c_event)
    {
        __BKPT(0);
    }
    /* Read data back from the I2C slave */
    i2c_event = I2C_MASTER_EVENT_ABORTED;
    timeout_ms           = 1000000;
    return 0;
}

/*
 * @brief  Read generic device register (platform dependent)
 *
 * @param  handle    customizable argument. In this examples is used in
 *                   order to select the correct sensor bus handler.
 * @param  reg       register to read
 * @param  bufp      pointer to buffer that store the data read
 * @param  len       number of consecutive register to read
 *
 */
static int32_t platform_read(void *handle, uint8_t reg, uint8_t *bufp,uint16_t len)
{
    err = R_IIC_MASTER_Write(&g_i2c_master0_ctrl, &reg, 1, true);
    assert(FSP_SUCCESS == err);
    /* Since there is nothing else to do, block until Callback triggers*/
    //while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms)
    while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms>0)
    {
        R_BSP_SoftwareDelay(1U, BSP_DELAY_UNITS_MICROSECONDS);
        timeout_ms--;
        }
    if (I2C_MASTER_EVENT_ABORTED == i2c_event)
    {
        __BKPT(0);
        }
    /* Read data back from the I2C slave */
    i2c_event = I2C_MASTER_EVENT_ABORTED;
    timeout_ms           = 1000000;

    /* Read data from I2C slave */
    err = R_IIC_MASTER_Read(&g_i2c_master0_ctrl, bufp, len, false);
    assert(FSP_SUCCESS == err);
    while ((I2C_MASTER_EVENT_RX_COMPLETE != i2c_event) && timeout_ms)
    {
        R_BSP_SoftwareDelay(1U, BSP_DELAY_UNITS_MILLISECONDS);
        timeout_ms--;
    }
    if (I2C_MASTER_EVENT_ABORTED == i2c_event)
    {
        __BKPT(0);
    }

    i2c_event = I2C_MASTER_EVENT_ABORTED;
    timeout_ms           = 1000000;
  return 0;
}


/*
 * @brief  platform specific delay (platform dependent)
 *
 * @param  ms        delay in ms
 *
 */
static void platform_delay(uint32_t ms)
{
    R_BSP_SoftwareDelay(ms, BSP_DELAY_UNITS_MILLISECONDS);
}


/*******************************************************************************************************************//**
 * This function is called at various points during the startup process.  This implementation uses the event that is
 * called right before main() to set up the pins.
 *
 * @param[in]  event    Where at in the start up process the code is currently at
 **********************************************************************************************************************/
void R_BSP_WarmStart(bsp_warm_start_event_t event)
{
    if (BSP_WARM_START_RESET == event)
    {
#if BSP_FEATURE_FLASH_LP_VERSION != 0

        /* Enable reading from data flash. */
        R_FACI_LP->DFLCTL = 1U;

        /* Would normally have to wait tDSTOP(6us) for data flash recovery. Placing the enable here, before clock and
         * C runtime initialization, should negate the need for a delay since the initialization will typically take more than 6us. */
#endif
    }

    if (BSP_WARM_START_POST_C == event)
    {
        /* C runtime environment and system clocks are setup. */

        /* Configure pins. */
        R_IOPORT_Open (&IOPORT_CFG_CTRL, &IOPORT_CFG_NAME);

#if BSP_CFG_SDRAM_ENABLED

        /* Setup SDRAM and initialize it. Must configure pins first. */
        R_BSP_SdramInit(true);
#endif
    }
}

#if BSP_TZ_SECURE_BUILD

FSP_CPP_HEADER
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ();

/* Trustzone Secure Projects require at least one nonsecure callable function in order to build (Remove this if it is not required to build). */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ()
{

}
FSP_CPP_FOOTER

#endif
